Repository: tu-graz-library/invenio-config-tugraz
Catalog: invenio_config_tugraz/translations/*/LC_MESSAGES/messages.po
Languages: de

source: Welcome to TU Graz Repository!
de: Willkommen im TU Graz Repository!

source: Dear user,
de: Lieber Nutzer,

source: Welcome to the Repository of TU Graz!
de: Willkommen im TU Graz Repository!

source: To help you get started, here are some useful links:
de: Um Ihnen den Einstieg zu erleichtern, finden Sie hier einige nützliche Links:

source: Guidelines:
de: Leitfaden:

source: Repository Guide
de: Handbuch

source: how to upload files
de: wie man Dateien hochlädt

source: Search Guide
de: Suchanleitung

source: Terms And Conditions
de: Nutzungsbedingungen

source: Data Protection Rights
de: Datenschutzerklärung

source: You can confirm your email through the link below:
de: Sie können Ihre E-Mail über den folgenden Link bestätigen:

source: If you require any assistance please do not hesitate to contact us at repository-support@tugraz.at.
de: Wenn Sie Hilfe benötigen, zögern Sie bitte nicht, uns unter repository-support@tugraz.at zu kontaktieren.

source: Best regards,
de: Mit freundlichen Grüßen,
